# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8-cls image classification model. For Usage examples see https://docs.ultralytics.com/tasks/classify

# Parameters
nc: 2  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n-cls.yaml' will call yolov8-cls.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.05, 0.1, 512]  # YOLOv8n summary: 225 layers,  3157200 parameters,  3157184 gradients,   8.9 GFLOPs
  # n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 1024]
  l: [1.00, 1.00, 1024]
  x: [1.00, 1.25, 1024]

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, RepConv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, RepConv, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, RepBlock, [128, True]]
  - [-1, 1, RepConv, [256, 3, 2]]  # 3-P3/8
  - [-1, 6, RepBlock, [256, True]]
  - [-1, 1, RepConv, [512, 3, 2]]  # 5-P4/16
  - [-1, 6, RepBlock, [512, True]]
  - [-1, 1, RepConv, [1024, 3, 2]]  # 7-P5/32
  - [-1, 3, RepBlock, [1024, True]]

# YOLOv8.0n head
head:
  - [-1, 1, Classify, [nc]]  # Classify
